Revit 2027 API
BuiltInFailures.MEPFabricationFailures.CannotMatchFabricationHangerSizeToHost Property
 The hanger cannot be re-sized to match the re-sized host.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId CannotMatchFabricationHangerSizeToHost { get; }
Public Shared ReadOnly Property CannotMatchFabricationHangerSizeToHost As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ CannotMatchFabricationHangerSizeToHost {
	FailureDefinitionId^ get ();
}
static member CannotMatchFabricationHangerSizeToHost : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.MEPFabricationFailures Class
Autodesk.Revit.DB Namespace